/* This computer's Internet connection appears to be offline. */
"CONNECTION_DOWN" = "การเชื่อมต่ออินเทอร์เน็ตของคอมพิวเตอร์นี้ออฟไลน์";

/* This computer's Internet connection may be offline. */
"CONNECTION_INDETERMINATE" = "การเชื่อมต่ออินเทอร์เน็ตของคอมพิวเตอร์นี้อาจจะออฟไลน์";

/* This computer's Internet connection appears to be online. */
"CONNECTION_UP" = "การเชื่อมต่ออินเทอร์เน็ตของคอมพิวเตอร์นี้ออนไลน์";

/* This computer's DNS server is not responding. */
"NAMESERVER_DOWN" = "เซิร์ฟเวอร์ DNS ไม่ตอบกลับ";

/* The DNS server could not find the server name. */
"NAMELOOKUP_FAILED" = "เซิร์ฟเวอร์ DNS ไม่สามารถหาชื่อเซิร์ฟเวอร์";

/* This computer's router is not responding. */
"ROUTER_DOWN" = "router ไม่ตอบกลับ";

/* The server this computer is attempting to connect to is not responding. */
"SERVER_DOWN" = "เซิร์ฟเวอร์ที่พยายามติดต่อไม่ตอบกลับ";

/* This computer's Internet connection appears to be online. */
"SERVER_UP" = "การเชื่อมต่ออินเทอร์เน็ตของคอมพิวเตอร์นี้ออนไลน์";

/* Format string for label of a saved password in Keychain: URL (USERNAME) */
"KEYCHAIN_LABEL_FORMAT" = "%@ (%@)";

/* Kind string used for keychain items from forms-based logins */
"KEYCHAIN_WEB_FORM_PASSWORD" = "รหัสผ่านเว็บฟอร์ม";

/* HTTP result code string */
"accepted" = "ยอมรับ";

/* HTTP result code string */
"bad gateway" = "เกตเวย์เสีย";

/* HTTP result code string */
"bad request" = "คำขอเสีย";

/* HTTP result code string */
"client error" = "ข้อผิดพลาดไคลเอนด์";

/* HTTP result code string */
"conflict" = "ปัญหา";

/* HTTP result code string */
"continue" = "ต่อไป";

/* HTTP result code string */
"created" = "สร้าง";

/* HTTP result code string */
"expectation failed" = "expectation ไม่ผ่าน";

/* HTTP result code string */
"forbidden" = "ต้องห้าม";

/* HTTP result code string */
"found" = "หาพบ";

/* HTTP result code string */
"gateway timed out" = "เกตเวย์หมดเวลา";

/* HTTP result code string */
"informational" = "เกี่ยวกับข้อมูล";

/* HTTP result code string */
"internal server error" = "ข้อผิดพลาดเซิร์ฟเวอร์ภายใน";

/* HTTP result code string */
"length required" = "ความยาวต้องระบุ";

/* HTTP result code string */
"method not allowed" = "ไม่อนุญาตวิธีนี้";

/* HTTP result code string */
"moved permanently" = "ย้ายถาวร";

/* HTTP result code string */
"multiple choices" = "หลายข้อเลือก";

/* HTTP result code string */
"needs proxy" = "ต้องการ proxy";

/* HTTP result code string */
"no content" = "ไม่มีเนื้อหา";

/* HTTP result code string */
"no error" = "ไม่มีข้อผิดพลาด";

/* HTTP result code string */
"non-authoritative information" = "ข้อมูลที่ไม่ต้องขออนุญาต";

/* HTTP result code string */
"not found" = "ไม่พบ";

/* HTTP result code string */
"not modified" = "ไม่เปลี่ยน";

/* HTTP result code string */
"partial content" = "เนื้อหาบางส่วน";

/* HTTP result code string */
"payment required" = "ต้องทำการจ่าย";

/* HTTP result code string */
"precondition failed" = "เงื่อนไขเบื้องต้นไม่ผ่าน";

/* HTTP result code string */
"proxy authentication required" = "ต้องใช้การยืนยัน Proxy";

/* HTTP result code string */
"redirected" = "ถูกเปลี่ยนทาง";

/* HTTP result code string */
"no longer exists" = "ไม่มีแล้ว";

/* HTTP result code string */
"request timed out" = "คำขอหมดเวลา";

/* HTTP result code string */
"request too large" = "คำขอใหญ่เกินไป";

/* HTTP result code string */
"requested URL too long" = "URL ที่ขอยาวไป";

/* HTTP result code string */
"requested range not satisfiable" = "ระยะที่ขอไม่ได้ตามต้องการ";

/* HTTP result code string */
"reset content" = "รีเซ็ทเนื้อหา";

/* HTTP result code string */
"see other" = "ดูรายการอื่น";

/* HTTP result code string */
"server error" = "ข้อผิดพลาดเซิร์ฟเวอร์";

/* HTTP result code string */
"service unavailable" = "ไม่มีบริการ";

/* HTTP result code string */
"success" = "สำเร็จ";

/* HTTP result code string */
"switching protocols" = "สลับเปลี่ยนโปรโตคอล";

/* HTTP result code string */
"temporarily redirected" = "ถูกเปลี่ยนทางชั่วคราว";

/* HTTP result code string */
"unacceptable" = "ยอมรับไม่ได้";

/* HTTP result code string */
"unauthorized" = "ไม่อนุญาต";

/* HTTP result code string */
"unimplemented" = "ยังไม่สร้างขึ้น";

/* HTTP result code string */
"unsupported media type" = "ประเภทสื่อใช้ไม่ได้กับระบบ";

/* HTTP result code string */
"unsupported version" = "ไม่รองรับเวอร์ชั่นนี้";

/* kCFErrorHTTPProxyConnectionFailure description */
"Err306" = "มีปัญหาติดต่อกับเซิร์ฟเวอร์เว็บ proxy (HTTP)";

/* kCFErrorHTTPSProxyConnectionFailure description */
"Err310" = "มีปัญหาติดต่อกับเซิร์ฟเวอร์เว็บ proxy (HTTP) แบบรัดกุม";

/* WebFoundationErrorUnknown description */
"Err-998" = "ข้อผิดพลาดที่ไม่ได้กำหนด";

/* WebFoundationErrorCancelled description */
"Err-999" = "ยกเลิก";

/* WebFoundationErrorBadURLError description */
"Err-1000" = "URL ไม่ดี";

/* WebFoundationErrorTimedOut description */
"Err-1001" = "คำขอหมดเวลา";

/* WebFoundationErrorUnsupportedURL description */
"Err-1002" = "ไม่รองรับ URL";

/* WebFoundationErrorCannotFindHostError description */
"Err-1003" = "ไม่พบเซิร์ฟเวอร์ตามชื่อที่ระบุ";

/* WebFoundationErrorCannotConnectToHostError description */
"Err-1004" = "ไม่สามารถติดต่อกับเซิร์ฟเวอร์";

/* WebFoundationErrorNetworkConnectionLostError description */
"Err-1005" = "การเชื่อมต่อกับเครือข่ายหายไป";

/* WebFoundationErrorDNSLookupError description */
"Err-1006" = "ข้อผิดพลาดค้นหา DNS";

/* WebFoundationErrorHTTPTooManyRedirectsError description */
"Err-1007" = "มีการเปลี่ยนทาง HTTP มากเกินไป";

/* WebFoundationErrorResourceUnavailableError description */
"Err-1008" = "รีซอร์ซไม่พร้อมใช้";

/* WebFoundationErrorNotConnectedToInternetError description */
"Err-1009" = "การเชื่อมต่ออินเทอร์เน็ตดูเหมือนว่าออฟไลน์";

/* WebFoundationErrorRedirectToNonExistentLocation description */
"Err-1010" = "ไม่มีที่อยู่หน้าเว็บที่เปลี่ยนทาง";

/* WebFoundationErrorBadServerResponseError description */
"Err-1011" = "มีการตอบกลับที่เสียจากเซิร์ฟเวอร์";

/* WebFoundationErrorZeroByteResourceError description */
"Err-1014" = "รีซอร์ซศูนย์ไบต์";

/* WebFoundationErrorCannotDecodeRawData description */
"Err-1015" = "ถอดรหัสข้อมูลเปล่าไม่ได้";

/* WebFoundationErrorCannotDecodeContentData description */
"Err-1016" = "ไม่สามารถถอดรหัสเนื้อข้อมูล";

/* WebFoundationErrorCannotParseResponse description */
"Err-1017" = "ตีความในการตอบสนองไม่่ได้";

/* kCFURLErrorInternationalRoamingOff description */
"Err-1018" = "การใช้เครือข่ายร่วมระหว่างประเทศปิดใช้อยู่ขณะนี้";

/* kCFURLErrorCallIsActive description */
"Err-1019" = "ไม่สามารถเริ่มการเชื่อมต่อข้อมูลเนื่องจากมีการใช้สายอยู่ขณะนี้";

/* kCFURLErrorDataNotAllowed description */
"Err-1020" = "ไม่อนุญาตให้เชื่อมต่อข้อมูลขณะนี้";

/* kCFURLErrorRequestBodyStreamExhausted description.  Should never be seen by an end user. */
"Err-1021" = "การขอข้อมูลส่วนเนื้อหาหยุด";
	
/* WebFoundationErrorFileDoesNotExist description */
"Err-1100" = "ไม่พบ URL ที่ขอใช้บนเซิร์ฟเวอร์นี้";

/* WebFoundationErrorFileIsDirectory description */
"Err-1101" = "ไฟล์นี้คือไดเร็กทอรี";

/* WebFoundationErrorNoPermissionsToReadFile description */
"Err-1102" = "คุณไม่มีสิทธิเข้าใช้รีซอร์ซที่ขอ";

/* WebFoundationErrorDataLengthExceedsMaximum description */
"Err-1103" = "รีซอร์ซเกินขนาดใหญ่สุดที่กำหนด";

/* WebFoundationErrorSecureConnectionFailed description */
"Err-1200" = "ปัญหา SSL เกิดขึ้นและไม่สามารถสร้างการเชื่อมต่อแบบรัดกุมกับเซิร์ฟเวอร์";

/* WebFoundationErrorServerCertificateHasBadDate description */
"Err-1201" = "ใบรับรองเซิร์ฟเวอร์หมดเวลาใช้";

/* WebFoundationErrorServerCertificateHasBadDate description */
"Err-1201.w" = "ใบรับรองเซิร์ฟเวอร์หมดเวลาใช้ คุณอาจจะเชื่อมต่อกับเซิร์ฟเวอร์ที่แกล้งเป็น “%@” ซึ่งจะเป็นอันตรายกับข้อมูลส่วนตัวของคุณ";

/* WebFoundationErrorServerCertificateUntrusted description */
"Err-1202" = "ใบรับรองเซิร์ฟเวอร์ไม่ถูกต้อง";

/* WebFoundationErrorServerCertificateUntrusted description */
"Err-1202.w" = "ใบรับรองเซิร์ฟเวอร์ไม่ถูกต้อง คุณอาจจะเชื่อมต่อกับเซิร์ฟเวอร์ที่แกล้งเป็น “%@” ซึ่งจะเป็นอันตรายกับข้อมูลส่วนตัวของคุณ";

/* WebFoundationErrorServerCertificateHasUnknownRoot description */
"Err-1203" = "ใบรับรองสำหรับเซิร์ฟเวอร์นี้ได้รับอนุญาตจากผู้ที่ไม่รู้จัก";

/* WebFoundationErrorServerCertificateHasUnknownRoot description */
"Err-1203.w" = "ใบรับรองเซิร์ฟเวอร์ได้รับอนุญาตจากผู้ที่ไม่รู้จัก คุณอาจจะเชื่อมต่อกับเซิร์ฟเวอร์ที่แกล้งเป็น “%@” ซึ่งจะเป็นอันตรายกับข้อมูลส่วนตัวของคุณ";

/* WebFoundationErrorServerCertificateNotYetValid description */
"Err-1204" = "ใบรับรองเซิร์ฟเวอร์ยังใช้ไม่ได้";

/* WebFoundationErrorServerCertificateNotYetValid description */
"Err-1204.w" = "ใบรับรองเซิร์ฟเวอร์ยังใช้ไม่ได้ คุณอาจจะเชื่อมต่อกับเซิร์ฟเวอร์ที่แกล้งเป็น “%@” ซึ่งจะเป็นอันตรายกับข้อมูลส่วนตัวของคุณ";

/* WebFoundationErrorClientCertificateRejected description */
"Err-1205" = "เซิร์ฟเวอร์ไม่ยอมรับใบรับรอง";

/* WebFoundationErrorClientCertificateRejected description */
"Err-1205.w" = "เซิร์ฟเวอร์ “%@” ไม่ยอมรับใบรับรอง";

/* WebFoundationErrorClientCertificateRequired description */
"Err-1206" = "เซิร์ฟเวอร์ต้องการใบรับรอง client";

/* WebFoundationErrorClientCertificateRequired description */
"Err-1206.w" = "เซิร์ฟเวอร์ “%@” ต้องการใบรับรอง client";

/* WebFoundationErrorCannotLoadFromNetworkError description */
"Err-2000" = "ไม่สามารถโหลดจากเครือข่าย";

/* WebFoundationErrorCannotCreateFile description */
"Err-3000" = "ไม่สามารถสร้างไฟล์";

/* WebFoundationErrorCannotOpenFile description */
"Err-3001" = "ไม่สามารถเปิดไฟล์";

/* WebFoundationErrorCannotCloseFile description */
"Err-3002" = "ความล้มเหลวเกิดขึ้น ในขณะปิดไฟล์";

/* WebFoundationErrorCannotWriteToFile description */
"Err-3003" = "ไม่สามารถเขียนไฟล์";

/* WebFoundationErrorCannotRemoveFile description */
"Err-3004" = "ไม่สามารถลบไฟล์";

/* WebFoundationErrorCannotMoveFile description */
"Err-3005" = "ไม่สามารถย้ายไฟล์";

/* WebFoundationErrorDownloadDecodingFailedMidStream description */
"Err-3006" = "ถอดรหัสดาวน์โหลดไม่สำเร็จ";

/* WebFoundationErrorDownloadDecodingFailedToComplete description */
"Err-3007" = "ถอดรหัสดาวน์โหลดไม่สำเร็จ";

/* Recovery suggestion */
"Would you like to connect to the server anyway?" = "ต้องการติดต่อกับเซิร์ฟเวอร์หรือไม่";

/* Recovery suggestion */
"To change your proxy settings, open Network preferences, click Advanced, and then click Proxies. For help with this problem, contact your system administrator." = "ในการเปลี่ยนค่าติดตั้ง proxy  เปิดตั้งค่าเครือข่าย คลิกขั้นสูงและคลิก Proxies หากต้องการความช่วยเหลือ ติดต่อผู้ดูแลระบบของคุณ";

/* AuthBrokerAgent proxy credential user notification - alert header */
"Proxy Authentication Required" = "ต้องใช้การยืนยันของพร็อกซี";

/* AuthBrokerAgent proxy credential user notification - alert message, args are 1) proxy type, 2) host name, 3) port number, e.g.:  Authentication for HTTP proxy csd3.apple.com:8080 */
"Authentication for %@ proxy\n%@:%d" = "การยืนยันสำหรับพร็อกซีของ %@\n%@:%d";

/* AuthBrokerAgent proxy credential user notification - Cancel button title */
"Cancel" = "ยกเลิก";

/* AuthBrokerAgent proxy credential user notification - Username title */
"Username" = "ชื่อผู้ใช้";

/* AuthBrokerAgent proxy credential user notification - Password title */
"Password" = "รหัสผ่าน";
